##################################### [ 도전문제 19 ] ###################################
#
#        3
# x    12
#-------
#       36
#

a = 3
b = 12
print("{:>8}".format(a))
print("x{:>6}".format(b))
print('--' * 4)
print("{:>7}".format(a*b))




print('--' * 45)

##################################### [ 도전문제 20 ] #####################################
#
#   a, b 두 개의 변수에 "123456"과 "7890"라는 값을 넣고
#   이 변수를 사용하여 다음과 세로셈으로 덧셈 결과를
#   출력하는 코드를 만들어라.
#
#   천의 자리 쉼표를 표시해야 한다.
#

a = 123456
b = 7890

print("{:10,}".format(a))
print("+{:9,}".format(b))
print("--" * 6)
print("{:>10,}".format(a + b))
